In [1]:
import pandas as pd

In [2]:
#loading data

df=pd.read_csv('/Users/admin/Downloads/SacramentocrimeJanuary2006.csv')

In [45]:
#Getting info about your data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7584 entries, 0 to 7583
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   cdatetime      7584 non-null   object
 1   address        7584 non-null   object
 2   district       7584 non-null   int64
 3   beat           7584 non-null   object
 4   grid           7584 non-null   int64
 5   crimedescr     7584 non-null   object
 6   ucr_ncic_code  7584 non-null   int64
 7   latitude       7584 non-null   float64
 8   longitude      7584 non-null   float64
dtypes: float64(2), int64(3), object(4)
memory usage: 533.4+ KB

In [3]:
df.head()

,cdatetime,address,district,beat,grid,crimedescr,ucr_ncic_code,latitude,longitude
0,1/1/06 0:00,3108 OCCIDENTAL DR,3,3C,1115,10851(A)VC TAKE VEH W/O OWNER,2404,38.550420,-121.391416
1,1/1/06 0:00,2082 EXPEDITION WAY,5,5A,1512,459 PC BURGLARY RESIDENCE,2204,38.473501,-121.490186
2,1/1/06 0:00,4 PALEN CT,2,2A,212,10851(A)VC TAKE VEH W/O OWNER,2404,38.657846,-121.462101
3,1/1/06 0:00,22 BECKFORD CT,6,6C,1443,476 PC PASS FICTICIOUS CHECK,2501,38.506774,-121.426951
4,1/1/06 0:00,3421 AUBURN BLVD,2,2A,508,459 PC BURGLARY-UNSPECIFIED,2299,38.637448,-121.384613

In [4]:
#outputs just a tuple of (rows, columns)
df.shape

(7584, 9)

In [48]:
#Handling duplicates
#This dataset does not have duplicate rows
#but it is always important to verify you aren't aggregating duplicate rows.
#To demonstrate, let's simply just double up our DataFrame by appending it to itself:
temp_df = df.append(df)
#append() will return a copy without affecting the original DataFrame.

In [49]:
temp_df.shape

(15168, 9)

In [50]:
#Now we can try dropping duplicates:
temp_df = temp_df.drop_duplicates()
#Using inplace=True will modify the DataFrame object in place:

In [51]:
temp_df.shape

(7546, 9)

In [6]:
#we didn't define the keep arugment in the previous example
#it was defaulted to first. This means that if two rows are the same
#pandas will drop the second row and keep the first row.
Current Kernel Logo
Pyt
#Using last has the opposite effect: the first row is dropped.
#first: (default) Drop duplicates except for the first occurrence.
#last: Drop duplicates except for the last occurrence.
#False: Drop all duplicates.

# make a new copy
temp_df = df.append(df)

#keep, on the other hand, will drop all duplicates. If two rows are the same then both will be dropped.
temp_df.drop_duplicates(inplace=True, keep=False)

temp_df.shape

(0, 9)

In [53]:
#Column cleanup
#Here's how to print the column names of our dataset:
df.columns

Index(['cdatetime', 'address', 'district', 'beat', 'grid', 'crimedescr',
       'ucr_ncic_code', 'latitude', 'longitude'],
      dtype='object')

In [7]:
#We can use the .rename() method to rename certain or all columns via a dict.
#We don't want parentheses, so let's rename those:

df.rename(columns={
        'cdatetime': 'crimedate&time', 
        'district': 'districtcode'
    }, inplace=True)
df.columns

Index(['crimedate&time', 'address', 'districtcode', 'beat', 'grid',
       'crimedescr', 'ucr_ncic_code', 'latitude', 'longitude'],
      dtype='object')

In [8]:
#How to work with missing values
#When exploring data, you’ll most likely encounter missing or null values
#Get rid of rows or columns with nulls
#Replace nulls with non-null values, a technique known as imputation

#first step is to check which cells in our DataFrame are null:
df.isnull()

#Notice isnull() returns a DataFrame where each cell is either True or False depending on that cell's null status.

,crimedate&time,address,districtcode,beat,grid,crimedescr,ucr_ncic_code,latitude,longitude
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
7579,False,False,False,False,False,False,False,False,False
7580,False,False,False,False,False,False,False,False,False
7581,False,False,False,False,False,False,False,False,False
7582,False,False,False,False,False,False,False,False,False
7583,False,False,False,False,False,False,False,False,False

In [9]:
#To count the number of nulls in each column we use an aggregate function for summing:
df.isnull().sum()

crimedate&time    0
address           0
districtcode      0
beat              0
grid              0
crimedescr        0
ucr_ncic_code     0
latitude          0
longitude         0
dtype: int64

In [11]:
df2=pd.read_csv('/Users/admin/Downloads/COVIDclinicaltrials.csv')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2595 entries, 0 to 2594
Data columns (total 27 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Rank                     2595 non-null   int64
 1   NCT Number               2595 non-null   object
 2   Title                    2595 non-null   object
 3   Acronym                  1217 non-null   object
 4   Status                   2595 non-null   object
 5   Study Results            2595 non-null   object
 6   Conditions               2595 non-null   object
 7   Interventions            2181 non-null   object
 8   Outcome Measures         2573 non-null   object
 9   Sponsor/Collaborators    2595 non-null   object
 10  Gender                   2590 non-null   object
 11  Age                      2595 non-null   object
 12  Phases                   1468 non-null   object
 13  Enrollment               2573 non-null   float64
 14  Funded Bys               2595 non-null   object
 15  Study Type               2595 non-null   object
 16  Study Designs            2572 non-null   object
 17  Other IDs                2594 non-null   object
 18  Start Date               2573 non-null   object
 19  Primary Completion Date  2572 non-null   object
 20  Completion Date          2572 non-null   object
 21  First Posted             2595 non-null   object
 22  Results First Posted     1 non-null      object
 23  Last Update Posted       2595 non-null   object
 24  Locations                2177 non-null   object
 25  Study Documents          48 non-null     object
 26  URL                      2595 non-null   object
dtypes: float64(1), int64(1), object(25)
memory usage: 547.5+ KB

In [58]:
df2.isnull().sum()

Rank                          0
NCT Number                    0
Title                         0
Acronym                    1378
Status                        0
Study Results                 0
Conditions                    0
Interventions               414
Outcome Measures             22
Sponsor/Collaborators         0
Gender                        5
Age                           0
Phases                     1127
Enrollment                   22
Funded Bys                    0
Study Type                    0
Study Designs                23
Other IDs                     1
Start Date                   22
Primary Completion Date      23
Completion Date              23
First Posted                  0
Results First Posted       2594
Last Update Posted            0
Locations                   418
Study Documents            2547
URL                           0
dtype: int64

In [13]:
#df2.dropna()
#This operation will delete any row with at least a single null value, 
#but it will return a new DataFrame without altering 
#the original one. You could specify inplace=True in this method as well.

# drop columns with null values by setting axis=1
df3=df2.dropna(axis=1)
#removing null data is only suggested if you have a small amount of missing data.

In [60]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2595 entries, 0 to 2594
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   2595 non-null   int64
 1   NCT Number             2595 non-null   object
 2   Title                  2595 non-null   object
 3   Status                 2595 non-null   object
 4   Study Results          2595 non-null   object
 5   Conditions             2595 non-null   object
 6   Sponsor/Collaborators  2595 non-null   object
 7   Age                    2595 non-null   object
 8   Funded Bys             2595 non-null   object
 9   Study Type             2595 non-null   object
 10  First Posted           2595 non-null   object
 11  Last Update Posted     2595 non-null   object
 12  URL                    2595 non-null   object
dtypes: int64(1), object(12)
memory usage: 263.7+ KB

In [61]:
df3.isnull().sum()

Rank                     0
NCT Number               0
Title                    0
Status                   0
Study Results            0
Conditions               0
Sponsor/Collaborators    0
Age                      0
Funded Bys               0
Study Type               0
First Posted             0
Last Update Posted       0
URL                      0
dtype: int64

In [15]:
#Imputation
#Imputation is a conventional feature engineering technique used to keep valuable data that have null values.
#There may be instances where dropping every row with a null value removes too big a chunk from your dataset,
#so instead we can impute that null with another value, usually the mean or the median of that column.

import numpy as np

In [18]:
#Imputation for Numeric Features

# create two columns of randomly generated values, replace a few examples with NaNs
data = {"X1": [np.nan, 0.7636183 , 0.61735332, 0.73848657, np.nan,
        0.71623709, 0.73075927, np.nan, 0.71073827, 0.54693503],
        "X2": [0.87505771, 0.77210971, 0.64369448, 0.54238232, 0.0710951 ,
        0.6854597 , np.nan, 0.20935994, 0.54764129, np.nan ]}
df1 = pd.DataFrame(data)
df1

         X1        X2
0       NaN  0.875058
1  0.763618  0.772110
2  0.617353  0.643694
3  0.738487  0.542382
4       NaN  0.071095
5  0.716237  0.685460
6  0.730759       NaN
7       NaN  0.209360
8  0.710738  0.547641
9  0.546935       NaN

In [22]:
#Imputation Method 1: Mean or Median

# replace missing values with the column mean
df_mean_imputed = df1.fillna(df1.mean())
#df_median_imputed = df.fillna(df.median())
df_mean_imputed

         X1        X2
0  0.689161  0.875058
1  0.763618  0.772110
2  0.617353  0.643694
3  0.738487  0.542382
4  0.689161  0.071095
5  0.716237  0.685460
6  0.730759  0.543350
7  0.689161  0.209360
8  0.710738  0.547641
9  0.546935  0.543350

In [23]:
#Imputation Method 2: Zero

# replace missing values with the column mean
df_zero_imputed = df1.fillna(0)
#df_zero_imputed

In [24]:
#Imputation for Categorical Data

data = {"X1": [np.nan, "Red" , "Blue", "Red", np.nan,
        "Red", "Green", np.nan, "Blue", "Red"],
        "X2": ["Green", "Green", "Red", "Blue", "Green" ,
        "Blue" , np.nan, "Red", "Green", np.nan ]}
colors = pd.DataFrame(data)

In [25]:
#Imputation Method 1: Most Common Class

# for each column, get value counts in decreasing order and take the index (value) of most common class
df_most_common_imputed = colors.apply(lambda x: x.fillna(x.value_counts().index[0]))
df_most_common_imputed

      X1     X2
0    Red  Green
1    Red  Green
2   Blue    Red
3    Red   Blue
4    Red  Green
5    Red   Blue
6  Green  Green
7    Red    Red
8   Blue  Green
9    Red  Green

In [27]:
#Imputation Method 2: “Unknown” Class

#Similar to how it’s sometimes most appropriate 
#to impute a missing numeric feature with zeros, 
#sometimes a categorical feature’s missing-ness itself
#is valuable information that should be explicitly encoded.


df_unknown_imputed = colors.fillna("Unknown")
df_unknown_imputed

        X1       X2
0  Unknown    Green
1      Red    Green
2     Blue      Red
3      Red     Blue
4  Unknown    Green
5      Red     Blue
6    Green  Unknown
7  Unknown      Red
8     Blue    Green
9      Red  Unknown